<?php
// +----------------------------------------------------------------------
// |
// +----------------------------------------------------------------------
// | ©2018 California State Lottery All rights reserved.
// +----------------------------------------------------------------------
// | Author: Smith Jack
// +----------------------------------------------------------------------

namespace by\component\message;


class MessageStatusEnum
{
    /**
     * 已投递 - 未读 0
     */
    const NOT_READ = 0;
    /**
     * 已投递 - 已读 1
     */
    const HAD_READ = 1;
    /**
     * 已|未投递 - 已删除
     */
    const SOFT_DELETE = 2;
}